#+title: Contrast ratio values of the Doric themes
#+author: Protesilaos Stavrou (https://protesilaos.com)
#+startup: content indent

Evaluate this snippet. Then update a table by typing =C-c C-c= with
point at the =#+TBLFM:= line.

#+begin_src emacs-lisp :results output silent
;; Copied from my `modus-themes'.

;; This is the WCAG formula to measure relative luminance:
;; <https://www.w3.org/TR/WCAG20-TECHS/G18.html>.
(defun modus-themes--wcag-contribution (channel weight)
  "Return the CHANNEL contribution to overall luminance given WEIGHT."
  (* weight
     (if (<= channel 0.03928)
         (/ channel 12.92)
       (expt (/ (+ channel 0.055) 1.055) 2.4))))

(defun modus-themes-wcag-formula (hex)
  "Get WCAG value of color value HEX.
The value is defined in hexadecimal RGB notation, such #123456."
  (let ((channels (color-name-to-rgb hex))
        (weights '(0.2126 0.7152 0.0722))
        contribution)
    (while channels
      (push (modus-themes--wcag-contribution (pop channels) (pop weights)) contribution))
    (apply #'+ contribution)))

;;;###autoload
(defun modus-themes-contrast (c1 c2)
  "Measure WCAG contrast ratio between C1 and C2.
C1 and C2 are color values written in hexadecimal RGB."
  (let ((ct (/ (+ (modus-themes-wcag-formula c1) 0.05)
               (+ (modus-themes-wcag-formula c2) 0.05))))
    (max ct (/ ct))))

(defalias #'Λ #'modus-themes-contrast)

;; Just an alias for the built-in function that measures distance
;; between colours...
(defalias #'Δ #'color-distance)
#+end_src

* Light themes
:PROPERTIES:
:CUSTOM_ID: h:light-themes
:END:
** Doric Cherry
:PROPERTIES:
:CUSTOM_ID: h:doric-cherry
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #dfd0d9 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #35292f |   12.15 |            10.43 |       9.38 |              5.66 |      9.39 |
| fg-shadow-subtle  | #675462 |    6.07 |             5.21 |       4.69 |              2.83 |      4.69 |
| fg-shadow-intense | #683455 |    8.29 |             7.12 |       6.41 |              3.87 |      6.41 |
| fg-accent         | #77266e |    8.02 |             6.89 |       6.19 |              3.74 |      6.20 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.44 |             8.97 |       8.06 |              4.87 |      8.07 |
| fg-faint-green    | #056100 |    6.75 |             5.80 |       5.21 |              3.15 |      5.22 |
| fg-faint-yellow   | #5f4602 |    7.76 |             6.66 |       5.99 |              3.62 |      6.00 |
| fg-faint-blue     | #353362 |   10.18 |             8.74 |       7.86 |              4.75 |      7.87 |
| fg-faint-magenta  | #553372 |    8.72 |             7.49 |       6.73 |              4.07 |      6.74 |
| fg-faint-cyan     | #35485e |    8.19 |             7.03 |       6.32 |              3.82 |      6.33 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #dfd0d9 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #f7edf1 |       0 |             2591 |       6292 |             43766 |      5533 |
| bg-shadow-subtle  | #e5dde0 |    2591 |                0 |        890 |             26336 |      1695 |
| bg-neutral        | #dfd0d9 |    6292 |              890 |          0 |             17584 |      1022 |
| bg-shadow-intense | #cc95b7 |   43766 |            26336 |      17584 |                 0 |     19021 |
| bg-accent         | #edcae5 |    5533 |             1695 |       1022 |             19021 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Earth
:PROPERTIES:
:CUSTOM_ID: h:doric-earth
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d7d3c2 |           #c09fa0 |   #e2cdb3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #30232e |   12.72 |            11.09 |       9.95 |              6.20 |      9.69 |
| fg-shadow-subtle  | #635650 |    6.01 |             5.23 |       4.70 |              2.92 |      4.57 |
| fg-shadow-intense | #58383f |    8.71 |             7.59 |       6.81 |              4.24 |      6.63 |
| fg-accent         | #74321f |    8.06 |             7.02 |       6.30 |              3.93 |      6.14 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.18 |             8.87 |       7.96 |              4.96 |      7.75 |
| fg-faint-green    | #056100 |    6.58 |             5.74 |       5.15 |              3.21 |      5.01 |
| fg-faint-yellow   | #5f4602 |    7.57 |             6.59 |       5.92 |              3.68 |      5.76 |
| fg-faint-blue     | #353362 |    9.93 |             8.65 |       7.76 |              4.83 |      7.56 |
| fg-faint-magenta  | #553372 |    8.51 |             7.41 |       6.65 |              4.14 |      6.48 |
| fg-faint-cyan     | #35485e |    7.98 |             6.96 |       6.24 |              3.89 |      6.08 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d7d3c2 |           #c09fa0 |   #e2cdb3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #f0eddf |       0 |             2246 |       6333 |             39749 |      8774 |
| bg-shadow-subtle  | #dfdfce |    2246 |                0 |       1075 |             23899 |      2889 |
| bg-neutral        | #d7d3c2 |    6333 |             1075 |          0 |             14957 |       978 |
| bg-shadow-intense | #c09fa0 |   39749 |            23899 |      14957 |                 0 |     12608 |
| bg-accent         | #e2cdb3 |    8774 |             2889 |        978 |             12608 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Light
:PROPERTIES:
:CUSTOM_ID: h:doric-light
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #e1e4e5 |           #a0bcd0 |   #d4edf0 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000000 |   21.00 |            18.30 |      16.43 |             10.60 |     17.17 |
| fg-shadow-subtle  | #455058 |    8.26 |             7.20 |       6.47 |              4.17 |      6.76 |
| fg-shadow-intense | #213067 |   12.48 |            10.87 |       9.76 |              6.30 |     10.20 |
| fg-accent         | #084092 |    9.73 |             8.48 |       7.61 |              4.91 |      7.95 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   11.96 |            10.42 |       9.35 |              6.03 |      9.78 |
| fg-faint-green    | #056100 |    7.73 |             6.74 |       6.05 |              3.90 |      6.32 |
| fg-faint-yellow   | #5f4602 |    8.89 |             7.74 |       6.95 |              4.48 |      7.27 |
| fg-faint-blue     | #353362 |   11.66 |            10.16 |       9.12 |              5.88 |      9.53 |
| fg-faint-magenta  | #553372 |    9.99 |             8.70 |       7.81 |              5.04 |      8.17 |
| fg-faint-cyan     | #35485e |    9.38 |             8.17 |       7.34 |              4.73 |      7.67 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #e1e4e5 |           #a0bcd0 |   #d4edf0 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #ffffff |       0 |             2143 |       7009 |             48556 |      7212 |
| bg-shadow-subtle  | #efeff2 |    2143 |                0 |       1418 |             30569 |      2143 |
| bg-neutral        | #e1e4e5 |    7009 |             1418 |          0 |             19178 |      1074 |
| bg-shadow-intense | #a0bcd0 |   48556 |            30569 |      19178 |                 0 |     19460 |
| bg-accent         | #d4edf0 |    7212 |             2143 |       1074 |             19460 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Marble
:PROPERTIES:
:CUSTOM_ID: h:doric-marble
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #d5d5d5 |           #b0b0b0 |   #e7dac6 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #202020 |   13.92 |            12.23 |      11.10 |              7.51 |     11.83 |
| fg-shadow-subtle  | #595959 |    5.98 |             5.26 |       4.77 |              3.23 |      5.08 |
| fg-shadow-intense | #404040 |    8.86 |             7.78 |       7.06 |              4.78 |      7.53 |
| fg-accent         | #603d3a |    8.06 |             7.08 |       6.43 |              4.35 |      6.85 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   10.21 |             8.97 |       8.15 |              5.51 |      8.68 |
| fg-faint-green    | #056100 |    6.60 |             5.80 |       5.27 |              3.56 |      5.61 |
| fg-faint-yellow   | #5f4602 |    7.59 |             6.67 |       6.05 |              4.10 |      6.45 |
| fg-faint-blue     | #353362 |    9.96 |             8.75 |       7.94 |              5.38 |      8.46 |
| fg-faint-magenta  | #553372 |    8.53 |             7.49 |       6.80 |              4.60 |      7.25 |
| fg-faint-cyan     | #35485e |    8.01 |             7.04 |       6.39 |              4.32 |      6.80 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #d5d5d5 |           #b0b0b0 |   #e7dac6 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #ededed |       0 |             1777 |       5224 |             33751 |      4753 |
| bg-shadow-subtle  | #dfdfdf |    1777 |                0 |        907 |             20036 |      1616 |
| bg-neutral        | #d5d5d5 |    5224 |              907 |          0 |             12417 |      1520 |
| bg-shadow-intense | #b0b0b0 |   33751 |            20036 |      12417 |                 0 |     16715 |
| bg-accent         | #e7dac6 |    4753 |             1616 |       1520 |             16715 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Wind
:PROPERTIES:
:CUSTOM_ID: h:doric-wind
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #e1e4e5 |           #a0bcd0 |   #d4edf0 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000000 |   21.00 |            18.30 |      16.43 |             10.60 |     17.17 |
| fg-shadow-subtle  | #455058 |    8.26 |             7.20 |       6.47 |              4.17 |      6.76 |
| fg-shadow-intense | #213067 |   12.48 |            10.87 |       9.76 |              6.30 |     10.20 |
| fg-accent         | #084092 |    9.73 |             8.48 |       7.61 |              4.91 |      7.95 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #750000 |   11.96 |            10.42 |       9.35 |              6.03 |      9.78 |
| fg-faint-green    | #056100 |    7.73 |             6.74 |       6.05 |              3.90 |      6.32 |
| fg-faint-yellow   | #5f4602 |    8.89 |             7.74 |       6.95 |              4.48 |      7.27 |
| fg-faint-blue     | #353362 |   11.66 |            10.16 |       9.12 |              5.88 |      9.53 |
| fg-faint-magenta  | #553372 |    9.99 |             8.70 |       7.81 |              5.04 |      8.17 |
| fg-faint-cyan     | #35485e |    9.38 |             8.17 |       7.34 |              4.73 |      7.67 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #e1e4e5 |           #a0bcd0 |   #d4edf0 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #e8f0e9 |    3479 |              317 |        757 |             26771 |      1298 |
| bg-shadow-subtle  | #d8e4df |    9563 |             2796 |        311 |             15614 |      1001 |
| bg-neutral        | #ced9db |   15585 |             6238 |       1740 |              9464 |      2683 |
| bg-shadow-intense | #94c2bf |   56317 |            37062 |      24282 |              1220 |     24175 |
| bg-accent         | #ded4fb |   10708 |             3955 |       2093 |             17166 |      3068 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

* Dark themes
:PROPERTIES:
:CUSTOM_ID: h:dark-themes
:END:
** Doric Dark
:PROPERTIES:
:CUSTOM_ID: h:doric-dark
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #3c3843 |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #ffffff |   21.00 |            13.35 |      11.42 |              8.49 |     12.97 |
| fg-shadow-subtle  | #a2a0b2 |    8.21 |             5.22 |       4.46 |              3.32 |      5.07 |
| fg-shadow-intense | #cfcff8 |   13.93 |             8.86 |       7.58 |              5.63 |      8.61 |
| fg-accent         | #cda4df |    9.97 |             6.34 |       5.42 |              4.03 |      6.16 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    9.70 |             6.17 |       5.28 |              3.92 |      5.99 |
| fg-faint-green    | #85c397 |   10.25 |             6.52 |       5.57 |              4.14 |      6.33 |
| fg-faint-yellow   | #c4a992 |    9.44 |             6.00 |       5.13 |              3.81 |      5.83 |
| fg-faint-blue     | #95afd2 |    9.34 |             5.94 |       5.08 |              3.77 |      5.77 |
| fg-faint-magenta  | #c5a3b2 |    9.26 |             5.88 |       5.03 |              3.74 |      5.72 |
| fg-faint-cyan     | #a5bfce |   10.94 |             6.96 |       5.95 |              4.42 |      6.76 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #3c3843 |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #000000 |       0 |            22833 |      33365 |             78768 |     29991 |
| bg-shadow-subtle  | #332d38 |   22833 |                0 |       1008 |             17981 |      3273 |
| bg-neutral        | #3c3843 |   33365 |             1008 |          0 |             11385 |      3861 |
| bg-shadow-intense | #50447f |   78768 |            17981 |      11385 |                 0 |     16560 |
| bg-accent         | #521e40 |   29991 |             3273 |       3861 |             16560 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Fire
:PROPERTIES:
:CUSTOM_ID: h:doric-fire
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a281d |          #40332f |    #493c37 |           #733930 |   #4e2a1f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #f0e5e0 |   11.97 |             9.81 |       8.56 |              7.21 |     10.14 |
| fg-shadow-subtle  | #afa497 |    6.04 |             4.95 |       4.32 |              3.64 |      5.12 |
| fg-shadow-intense | #dab8a4 |    8.01 |             6.56 |       5.73 |              4.83 |      6.79 |
| fg-accent         | #e0936f |    6.04 |             4.95 |       4.32 |              3.64 |      5.12 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #d09090 |    5.69 |             4.66 |       4.07 |              3.43 |      4.82 |
| fg-faint-green    | #85c397 |    7.22 |             5.92 |       5.16 |              4.35 |      6.12 |
| fg-faint-yellow   | #c4a992 |    6.65 |             5.45 |       4.75 |              4.00 |      5.63 |
| fg-faint-blue     | #95afd2 |    6.58 |             5.39 |       4.71 |              3.96 |      5.58 |
| fg-faint-magenta  | #c5a3b2 |    6.52 |             5.34 |       4.66 |              3.93 |      5.53 |
| fg-faint-cyan     | #a5bfce |    7.71 |             6.32 |       5.51 |              4.64 |      6.53 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a281d |          #40332f |    #493c37 |           #733930 |   #4e2a1f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #2a281d |       0 |             2476 |       5658 |             14539 |      2946 |
| bg-shadow-subtle  | #40332f |    2476 |                0 |        687 |              6310 |      1478 |
| bg-neutral        | #493c37 |    5658 |              687 |          0 |              4377 |      2933 |
| bg-shadow-intense | #733930 |   14539 |             6310 |       4377 |                 0 |      4952 |
| bg-accent         | #4e2a1f |    2946 |             1478 |       2933 |              4952 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Obsidian
:PROPERTIES:
:CUSTOM_ID: h:doric-obsidian
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #4a2b29 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e7e7e7 |   14.36 |            10.83 |       9.20 |              6.52 |     10.18 |
| fg-shadow-subtle  | #969696 |    6.00 |             4.53 |       3.85 |              2.73 |      4.25 |
| fg-shadow-intense | #b0b0b0 |    8.19 |             6.17 |       5.24 |              3.72 |      5.80 |
| fg-accent         | #b58f6b |    6.01 |             4.53 |       3.85 |              2.73 |      4.26 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    8.20 |             6.19 |       5.25 |              3.73 |      5.81 |
| fg-faint-green    | #85c397 |    8.67 |             6.53 |       5.55 |              3.94 |      6.14 |
| fg-faint-yellow   | #c4a992 |    7.98 |             6.02 |       5.11 |              3.62 |      5.66 |
| fg-faint-blue     | #95afd2 |    7.90 |             5.95 |       5.06 |              3.59 |      5.60 |
| fg-faint-magenta  | #c5a3b2 |    7.83 |             5.90 |       5.01 |              3.55 |      5.55 |
| fg-faint-cyan     | #a5bfce |    9.25 |             6.98 |       5.93 |              4.20 |      6.56 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #4a2b29 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #181818 |       0 |             4798 |      10485 |             28444 |      7796 |
| bg-shadow-subtle  | #2f2f2f |    4798 |                0 |       1097 |              9877 |      1808 |
| bg-neutral        | #3a3a3a |   10485 |             1097 |          0 |              4390 |      2288 |
| bg-shadow-intense | #505050 |   28444 |             9877 |       4390 |                 0 |      9738 |
| bg-accent         | #4a2b29 |    7796 |             1808 |       2288 |              9738 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)


** Doric Plum
:PROPERTIES:
:CUSTOM_ID: h:doric-plum
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #30283c |    #383349 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e2d7e7 |   12.14 |            10.11 |       8.69 |              6.13 |      9.46 |
| fg-shadow-subtle  | #a694b1 |    6.02 |             5.01 |       4.31 |              3.04 |      4.69 |
| fg-shadow-intense | #cea6d0 |    8.03 |             6.68 |       5.75 |              4.05 |      6.26 |
| fg-accent         | #c586ba |    6.02 |             5.01 |       4.31 |              3.04 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    7.79 |             6.49 |       5.58 |              3.93 |      6.08 |
| fg-faint-green    | #85c397 |    8.23 |             6.86 |       5.90 |              4.16 |      6.42 |
| fg-faint-yellow   | #c4a992 |    7.58 |             6.32 |       5.43 |              3.83 |      5.91 |
| fg-faint-blue     | #95afd2 |    7.50 |             6.25 |       5.37 |              3.79 |      5.85 |
| fg-faint-magenta  | #c5a3b2 |    7.44 |             6.19 |       5.33 |              3.75 |      5.80 |
| fg-faint-cyan     | #a5bfce |    8.79 |             7.32 |       6.30 |              4.44 |      6.86 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #30283c |    #383349 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #221832 |       0 |             1744 |       5505 |             25593 |      5289 |
| bg-shadow-subtle  | #30283c |    1744 |                0 |       1106 |             14795 |      2737 |
| bg-neutral        | #383349 |    5505 |             1106 |          0 |              8276 |      3426 |
| bg-shadow-intense | #5e4170 |   25593 |            14795 |       8276 |                 0 |     12099 |
| bg-accent         | #501e3e |    5289 |             2737 |       3426 |             12099 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Water
:PROPERTIES:
:CUSTOM_ID: h:doric-water
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #34384c |    #3e4053 |           #405290 |   #523e48 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #edf0f8 |   12.54 |            10.14 |       8.93 |              6.51 |      8.60 |
| fg-shadow-subtle  | #aea6b8 |    6.09 |             4.93 |       4.34 |              3.16 |      4.18 |
| fg-shadow-intense | #b8c2e0 |    8.05 |             6.51 |       5.73 |              4.18 |      5.52 |
| fg-accent         | #c2a0a0 |    6.01 |             4.86 |       4.28 |              3.12 |      4.12 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-faint-red      | #dba2a2 |    6.60 |             5.34 |       4.70 |              3.43 |      4.53 |
| fg-faint-green    | #85c397 |    6.98 |             5.64 |       4.97 |              3.63 |      4.79 |
| fg-faint-yellow   | #c4a992 |    6.42 |             5.20 |       4.57 |              3.34 |      4.41 |
| fg-faint-blue     | #95afd2 |    6.36 |             5.14 |       4.53 |              3.30 |      4.36 |
| fg-faint-magenta  | #c5a3b2 |    6.30 |             5.10 |       4.49 |              3.27 |      4.32 |
| fg-faint-cyan     | #a5bfce |    7.45 |             6.03 |       5.30 |              3.87 |      5.11 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #34384c |    #3e4053 |           #405290 |   #523e48 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #2a283d |       0 |             1890 |       4574 |             27573 |      5904 |
| bg-shadow-subtle  | #34384c |    1890 |                0 |        619 |             15968 |      2241 |
| bg-neutral        | #3e4053 |    4574 |              619 |          0 |             11639 |      1267 |
| bg-shadow-intense | #405290 |   27573 |            15968 |      11639 |                 0 |     16537 |
| bg-accent         | #523e48 |    5904 |             2241 |       1267 |             16537 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)
